magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_setCartShippingMethod_negative.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ShoppingCartShippingMethod soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
         <quoteId xsi:type="xsd:int">%s(quoteId)</quoteId>
         <method xsi:type="xsd:String">Invalid</method>
         <storeId xsi:type="xsd:String">%s(storeId)</storeId>
      </urn:ShoppingCartShippingMethod>
   </soapenv:Body>
</soapenv:Envelope>




